Revit 2024 API
BuiltInFailures.FamilyFailures.DuplicateParamName Property
 Family parameters have duplicate names.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Syntax
C#
public static FailureDefinitionId DuplicateParamName { get; }
Visual Basic
Public Shared ReadOnly Property DuplicateParamName As FailureDefinitionId
	Get
Visual C++
public:
static property FailureDefinitionId^ DuplicateParamName {
	FailureDefinitionId^ get ();
}
See Also
BuiltInFailures.FamilyFailures Class
Autodesk.Revit.DB Namespace